{
  "intro_paragraph_title": "About me",
  "intro_paragraph_body": "As a student of IT-product development, I am skilled in developing and designing physical products that incorporate digital technology. With a focus on creating user-friendly products, I have a deep understanding of user experience and user interface design principles that I incorporate into my work.I am proficient in programming languages such as Java and JavaScript, and I have experience working with databases, APIs, and frameworks, as well as with getting ChatGPT to write my CV intro. As a team player, I enjoy collaborating with others to achieve project goals, and I am committed to continuous learning and improvement in my field.",

  "Languages_and_frameworks_title": "Languages and Frameworks",
  "Languages_and_frameworks_body": "I primarily have experience with Java, C#, React, JavaScript. Besides these I have worked to a lesser extent with the .NET framework, C, C++, Python, Go, Vue, SQL, and LaTeX.",

  "tools_and_technologies_title": "Tools and Technologies",
  "tools_and_technologies_body": "From two years of Software Technology Engineering and three years of IT Product Development I have experience with many different aspects of development. Besides courses like Software Engineering and Architechture - where I worked as an instructor - I have a lot of experience with embedded systems and electrical systems. I have worked with Arduino, Raspberry Pi, the ATMega2560 microcontroller, and ESP32. In combination with these I have designed and built electrical systems both on breadboards and as PCBs, and worked with many different sensors and actuators such as servos and steppers, ultrasound sensors, optical sensors, and piezoresistive fabric.",

  "work_methods_title": "Work methods",
  "work_methods_body": "I completed a two-day, eight hour SCRUM course at Systematic, and I have experience working with SCRUM in teams of eight people.",

  "spaceship_title": "Spaceship toy",
  "spaceship_paragraph_1": "The spaceship toy was our project for the course Physical Computing, which was focused on using sensors and actuators to make a toy of our own design. We elected to make a spaceship which could lower its wings when landing, as well as fire a projectile the the flashing LEDs were fully engaged. The ship was built of a combination of 3D-printed and laser cut parts, and was controlled by an Atmega328p microcontroller.",
  "spaceship_paragraph_2": "While the electrical and programmatical parts of the project weren't particularly complex compared to other projects, we learned to see the value of rapid prototyping and properly planning in advance. During the project we put off the design of the mechanical innards of the rocket until the very end, which resulted in us having to put in a lot of extra work hours in the final week to make the product work in time.",

  "KLS_title": "KLS",
  "KLS_paragraph_1": "The K-nearest-neighbour Learning System was our product for the IT Product Design Project course, in which our case was to teach gymnasium students about machine learning. As the name implies we chose the K-nearest-neighbour algorithm, as it would be simple to implement, and easy to teach to students.",
  "KLS_paragraph_2": "As part of the project we developed a business model for the product based on an imagined market analysis. Since we did not perform any actual market research, the exercise mainly served to familiarize ourselves with the contents of a business model canvas.",

  "SOS_title": "Shape changing lamp",
  "SOS_paragraph_1": "The TheraLamp was our project for the course Shape Changing Objects and Spaces. The lamp was designed as a social robot to serve as a couples counsellor for simple relationship troubles. The lamp would be camouflaged as a regular ceiling lamp until activated, at which point it would be able to lead a conversation with two partners sitting at a table. The robot was developed as part of an interdisciplinary project with the philosophy course Social Robots, and was designed to lead a socratic dialogue developed by the students of that course.",
  "SOS_paragraph_2": "When activated, the inner ring would focus on the person the lamp was speaking to, while the outer two undulated slowly, to give the robot a sense of life. When the robot was listening, the outer ring would instead stay still while the inner two moved.",
  "SOS_paragraph_3": "The lamp functioned using three servos with wheels attached to strings, which would cause the rings to rotate around a brass rod. It was controlled through a web server hosted by an ESP32 microcontroller, which in turn controlled the lights, servos, and speaker. The ESP32 was powered by a power bank, while the servos were powered seperately with a variable power supply in order to eliminate electrical interference."
}